hard_teams = [
    ('Ман Сити', 'Англия'), ('Бавария', 'Германия'), ('Реал Мадрид', 'Испания'), ('Челси', 'Англия'),
    ('Ливерпуль', 'Англия'), ('ПСЖ', 'Франция'), ('МЮ', 'Англия'), ('Интер', 'Италия'),
    ('Рома', 'Италия'), ('Ювентус', 'Италия'), ('Лейпциг', 'Англия'), ('Севилья', 'Испания'),
    ('Боруссия Д', 'Англия'), ('Барселона', 'Испания'), ('Вильяреал', 'Англия'), ('Бенфика', 'Португалия')
]

medium_teams = [
    ('Атлетико', 'Англия'), ('Наполи', 'Италия'), ('Аякс', 'Нидерланды'), ('Байер', 'Германия'),
    ('Порту', 'Португалия'), ('Тоттенхэм', 'Англия'), ('Айнтрахт', 'Англия'), ('Шахтер Донецк', 'Украина'),
    ('Аталанта', 'Италия'), ('Базель', 'Швейцария'), ('Вест Хэм', 'Англия'), ('Арсенал Лондон', 'Англия'),
    ('Фейеноорд', 'Нидерланды'), ('Рейнджерс', 'Англия'), ('АЗ Алкмар', 'Нидерланды'), ('Лион', 'Франция'),
    ('Милан', 'Италия'), ('Брюгге', 'Бельгия'), ('Зальцбург', 'Англия'), ('Спортинг', 'Англия'),
    ('Брага', 'Португалия'), ('Динамо Зг', 'Англия'), ('ПСВ', 'Нидерланды'), ('Копенгаген', 'Дания'),
    ('Лацио', 'Италия'), ('Гент', 'Бельгия'), ('Црвена Звезда', 'Сербия'), ('ЛАСК', 'Австрия'),
    ('Реал Сосьедад', 'Испания'), ('Ренн', 'Франция'), ('Олимпиакос', 'Греция'), ('Олимпик', 'Англия'),
]

weak_teams = [
    ('Лилль', 'Франция'), ('Истанбул Башакшехир', 'Англия'), ('Янг Бойз', 'Швейцария'), ('Бетис', 'Испания'),
    ('ЧФР', 'Англия'), ('Ференцварош', 'Венгрия'), ('Селтик', 'Англия'), ('Динамо К', 'Англия'),
    ('Монако', 'Монако'), ('Галатасарай', 'Турция'), ('Митьюлланд', 'Англия'), ('Партизан', 'Сербия'),
    ('Лестер', 'Англия'), ('Слован Брт', 'Словакия'), ('Вольфсбург', 'Германия'), ('Фенербахче', 'Турция')
]
